sCO2Channel-DES_04/0/muSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      muSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    BotWall
    {
		type             fixedValue;
		value            uniform 0;
    }
    OtherWalls
    {
		type             fixedValue;
		value            uniform 0;
    }
    Inlet
    {
                type            zeroGradient;
    }
    Outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
