sCO2Channel-DES_04/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    BotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4500;
        startFace       395100;
    }
    OtherWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          13500;
        startFace       399600;
    }
    Inlet
    {
        type            patch;
        nFaces          900;
        startFace       413100;
    }
    Outlet
    {
        type            patch;
        nFaces          900;
        startFace       414000;
    }
)

// ************************************************************************* //
