sCO2Channel-DES_04/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     realFluidPISOSolver;

startFrom       latestTime;

//startTime       0;

stopAt          endTime;

endTime         0.03;

deltaT          1E-6;
maxDeltaT       1E-4;

//writeControl    timeStep;
writeControl    adjustableRunTime; 
writeInterval   1E-4;

purgeWrite      0;

writeFormat     binary;//ascii;
writeCompression on;//on;


writePrecision  6;



timeFormat      general;

timePrecision   10;

adjustTimeStep  yes;

maxCo          0.25;

runTimeModifiable yes;

libs ( "libspecie.so"
       "libfluidThermophysicalModels.so"
       "libsuperThermo.so"
       "libutilityFunctionObjects.so"
       "libOpenFOAM.so"
       "libgroovyBC.so"
       "libsimpleSwakFunctionObjects.so"
       "libswakFunctionObjects.so"   );

// ************************************************************************* //
